In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np 
import csv
import json

# Honey

In [18]:
data = pd.read_csv("../bee_data/6honey.csv")
honey = data.dropna(axis=1, how='all')

In [17]:
total_honey = honey.groupby(["Year", "State", "Commodity"], as_index = False)[['Value']].sum()

In [76]:
honey_totals = total_honey.rename(columns={'Year': 'year', 'State': 'state', 'Commodity': 'commodity', 'Value': 'total_lbs'})
honey_totals.head()

   year       state commodity  total_lbs
0  1987     ALABAMA     HONEY    242,000
1  1987     ARIZONA     HONEY    338,000
2  1987    ARKANSAS     HONEY    200,000
3  1987  CALIFORNIA     HONEY  1,782,000
4  1987    COLORADO     HONEY     96,000

# Pumpkins

In [39]:
data2 = pd.read_csv("../bee_data/1pumpkins.csv")
pumpkins = data2.dropna(axis=1, how='all')

In [37]:
total_pumpkins = pumpkins.groupby(["Year", "State", "Commodity"], as_index=False)[['Value']].sum()

In [75]:
pumpkin_totals = total_pumpkins.rename(columns={'Year': 'year', 'State': 'state', 'Commodity': 'commodity', 'Value': 'cwt/ac'})
pumpkin_totals.head()

   year       state commodity cwt/ac
0  2000  CALIFORNIA  PUMPKINS    305
1  2000    ILLINOIS  PUMPKINS    410
2  2000    MICHIGAN  PUMPKINS    160
3  2000    NEW YORK  PUMPKINS    200
4  2000        OHIO  PUMPKINS    165

In [36]:
## basically cwt/ac is * 100

# Almonds

In [48]:
data3 = pd.read_csv("../bee_data/2almonds.csv")
almonds = data3.dropna(axis=1, how='all')

In [44]:
total_almonds = almonds.groupby(["Year", "State", "Commodity"], as_index=False)[['Value']].sum()

In [74]:
almond_totals = total_almonds.rename(columns={'Year': 'year', 'State': 'state', 'Commodity': 'commodity', 'Value': 'lbs/ac'})
almond_totals.head()

   year       state commodity lbs/ac
0  2007  CALIFORNIA   ALMONDS  2,170
1  2007    US TOTAL   ALMONDS  2,170
2  2008  CALIFORNIA   ALMONDS  2,300
3  2008    US TOTAL   ALMONDS  2,400
4  2009  CALIFORNIA   ALMONDS  1,880

# Apples

In [58]:
data4 = pd.read_csv("../bee_data/3apples.csv")
apples = data4.dropna(axis=1, how='all')

In [59]:
total_apples = apples.groupby(["Year", "State", "Commodity"], as_index=False)[['Value']].sum()

In [73]:
apple_totals = total_almonds.rename(columns={'Year': 'year', 'State': 'state', 'Commodity': 'commodity', 'Value': 'lbs/ac'})
apple_totals.head()

   year       state commodity lbs/ac
0  2007  CALIFORNIA   ALMONDS  2,170
1  2007    US TOTAL   ALMONDS  2,170
2  2008  CALIFORNIA   ALMONDS  2,300
3  2008    US TOTAL   ALMONDS  2,400
4  2009  CALIFORNIA   ALMONDS  1,880

# Blueberries

In [61]:
data5 = pd.read_csv("../bee_data/4blueberries.csv")
blueberries = data5.dropna(axis=1, how='all')

In [62]:
total_blueberries = blueberries.groupby(["Year", "State", "Commodity"], as_index=False)[['Value']].sum()

In [71]:
blueberry_totals = total_blueberries.rename(columns={'Year': 'year', 'State': 'state', 'Commodity': 'commodity', 'Value': 'lbs/ac'})
blueberry_totals.head()

   year     state    commodity lbs/ac
0  2012     MAINE  BLUEBERRIES   (NA)
1  2012  US TOTAL  BLUEBERRIES   (NA)
2  2013     MAINE  BLUEBERRIES   (NA)
3  2013  US TOTAL  BLUEBERRIES   (NA)
4  2014     MAINE  BLUEBERRIES  4,580

# Cherries

In [66]:
data6 = pd.read_csv("../bee_data/4blueberries.csv")
cherries = data6.dropna(axis=1, how='all')

In [67]:
total_cherries = cherries.groupby(["Year", "State", "Commodity"], as_index=False)[['Value']].sum()

In [72]:
cherry_total = total_cherries.rename(columns={'Year': 'year', 'State': 'state', 'Commodity': 'commodity', 'Value': 'lbs/ac'})
cherry_total.head()

   year     state    commodity lbs/ac
0  2012     MAINE  BLUEBERRIES   (NA)
1  2012  US TOTAL  BLUEBERRIES   (NA)
2  2013     MAINE  BLUEBERRIES   (NA)
3  2013  US TOTAL  BLUEBERRIES   (NA)
4  2014     MAINE  BLUEBERRIES  4,580